app/Http/Controllers/AssessmentsController.php

                    return $button; // Return Button
                })
                ->addColumn('total_units', function ($AssessTbl) {
                    $units = SubjectTbl::select(DB::raw('SUM(lect_unit) as total'),
                        DB::raw('SUM(lab_unit) as total2'))
                        ->whereIn('id', json_decode($AssessTbl->subject_ids))->get();
---
select SUM(lect_unit) as total, SUM(lab_unit) as total2 from `subject_tbls` where `id` in ('303', '390', '315', '248', '306', '249', '312', '297', '300', '309')

        $data['title'] = 'Assessments';
        $data['permissions'] = AccessRoute::user_permissions(session('user')->id);
        $school_year_id = Helpers::currentSchoolYear('id');
        $data['levels'] = LevelsTbl::all();
        $data['branches'] = BranchTbl::all();
        $data['applications'] = EnrollmentTbl::select('id', 'application_no')->where('school_year_id', $school_year_id)
            ->where('is_approved', 1)->get();

        $res = null;

        $res = AssessmentsTbl::withSum('payment_history', 'payment_amount')
            ->addSelect([
                'total_balance' => PaymentHistoryTbl::whereColumn('assessments_id', 'assessments_tbls.id')
                    ->selectRaw('(assessments_tbls.fee_amount - sum(payment_amount)) as total_balance')
            ])
            ->where('is_active', 1)
            ->get();
---
select * from `levels_tbls`
select * from `branch_tbls`
select `id`, `application_no` from `enrollment_tbls` where `school_year_id` = 2 and `is_approved` = 1
select `assessments_tbls`.*, (select sum(`payment_history_tbls`.`payment_amount`) from `payment_history_tbls` where `assessments_tbls`.`id` = `payment_history_tbls`.`assessments_id`) as `payment_history_sum_payment_amount`, (select (assessments_tbls.fee_amount - sum(payment_amount)) as total_balance from `payment_history_tbls` where `assessments_id` = `assessments_tbls`.`id`) as `total_balance` from `assessments_tbls` where `is_active` = 1

    public function edit($id)
    {
        //
        $assessment_id = $id;
        $student_details = AssessmentsTbl::select("assessments_tbls.student_id",
            "assessments_tbls.student_department",
            "assessments_tbls.enrollment_id",
            "assessments_tbls.fees",
            "assessments_tbls.other_fees",
            "assessments_tbls.discounts",
            "enrollment_tbls.application_no",
            "enrollment_tbls.subject_ids",
            DB::raw("CONCAT(students_tbls.first_name,' ',students_tbls.middle_name,' ',students_tbls.last_name) AS studentName"),
            DB::raw("CONCAT(programs_tbls.program_name,' ',majors_tbls.major_name) AS programMajor"))
            ->leftJoin('students_tbls', 'assessments_tbls.student_id', '=', 'students_tbls.id')
            ->leftJoin('enrollment_tbls', 'assessments_tbls.enrollment_id', '=', 'enrollment_tbls.id')
            ->leftJoin('curriculum_tbls', 'enrollment_tbls.curriculum_id', '=', 'curriculum_tbls.id')
            ->leftJoin('program_majors_tbls', 'curriculum_tbls.program_major_id', '=', 'program_majors_tbls.id')
            ->leftJoin('programs_tbls', 'program_majors_tbls.program_id', '=', 'programs_tbls.id')
            ->leftJoin('majors_tbls', 'program_majors_tbls.major_id', '=', 'majors_tbls.id')
            ->where('assessments_tbls.id', $assessment_id)->first();
        // ->where(DB::raw('md5(assessments_tbls.id)'), $assessment_id)->first();
        // $type = "Discountable Fee";
        $dept = $student_details->student_department;
        $sub_ids = json_decode($student_details->subject_ids);

        $data['lect_units'] = SubjectTbl::select(DB::raw('SUM(lect_unit) AS total_lect_unit'))
            ->whereIn('id', $sub_ids)->get();

        $data['lab_units'] = SubjectTbl::select(DB::raw('SUM(lab_unit) AS total_lab_unit'))
            ->whereIn('id', $sub_ids)->get();

        $data['fees'] = FeesTbl::select('fees_tbls.*')
            ->where('fee_type', "Discountable Fee")
            ->where('student_department', $dept)
            ->where('is_active', 1)->get();

        $data['lec_amount'] = FeesTbl::select('fee_amount')
            ->where('fee_type', "Lec Unit")
            ->where('student_department', $dept)
            ->where('is_active', 1)->first();

        $data['lab_amount'] = FeesTbl::select('fee_amount')
            ->where('fee_type', "Lab Unit")
            ->where('student_department', $dept)
            ->where('is_active', 1)->first();

        $data['other_fees'] = FeesTbl::select('fees_tbls.*')
            ->where('fee_type', "Others")
            ->where('student_department', $dept)
            ->where('is_active', 1)->get();
---
select SUM(lect_unit) AS total_lect_unit from `subject_tbls` where `id` in ('343', '326', '342', '317', '346', '345', '388', '389')
select SUM(lab_unit) AS total_lab_unit from `subject_tbls` where `id` in ('343', '326', '342', '317', '346', '345', '388', '389')
select `fees_tbls`.* from `fees_tbls` where `fee_type` = 'Discountable Fee' and `student_department` = 'SHS' and `is_active` = 1
select `fee_amount` from `fees_tbls` where `fee_type` = 'Lec Unit' and `student_department` = 'SHS' and `is_active` = 1 limit 1
select `fee_amount` from `fees_tbls` where `fee_type` = 'Lab Unit' and `student_department` = 'SHS' and `is_active` = 1 limit 1
select `fees_tbls`.* from `fees_tbls` where `fee_type` = 'Others' and `student_department` = 'SHS' and `is_active` = 1

    public function update(Request $request, $id)
    {

        $data = AssessmentsTbl::find($id);
---
select * from `assessments_tbls` where `assessments_tbls`.`id` = '3783' limit 1

    public function getFeeAmount(Request $request)
    {
        $dept = $request->student_department;
        $val = $request->val;

        $data = FeesTbl::select('fees_tbls.fee_amount')
            ->where('fee_name', $val)
            ->where('student_department', $dept)
            ->where('is_active', 1)->first();
---
select `fees_tbls`.`fee_amount` from `fees_tbls` where `fee_name` = 'College Misc' and `student_department` = 'College' and `is_active` = 1 limit 1

    public function getDiscountsByDepartment(Request $request)
    {
        $dept = $request->student_department;

        $data['discs'] = DiscountsTbl::select('discounts_tbls.*')
            ->where('student_department', $dept)
            ->where('is_active', 1)->get();
---
select `discounts_tbls`.* from `discounts_tbls` where `student_department` = 'SHS' and `is_active` = 1