app/Http/Controllers/CollegeGradeController.php

select @rownum :=@rownum+1 as rowNum, `students_tbls`.`id` as `std_id`, `students_tbls`.`last_name`, `enrollment_tbls`.*, `grades`.*, `grades`.`subject_id` as `grade_id`, CONCAT(students_tbls.last_name, ', ',students_tbls.first_name, ' ',students_tbls.middle_name) as student_name from `students_tbls` inner join `enrollment_tbls` on `enrollment_tbls`.`student_id` = `students_tbls`.`id` inner join `grades` on `students_tbls`.`id` = `grades`.`student_id` where `grades`.`subject_id` = '15'
---
    public function show(Request $request, $id)
    {
        //

        DB::statement(DB::raw('set @rownum=0'));
        $sectionOne =  SubjectTbl::all()->where('id',$id);
        if(count($sectionOne)>0){
            if ($request->ajax()) {
        $students = StudentsTbl::select(DB::raw('@rownum :=@rownum+1 as rowNum'),
        "students_tbls.id as std_id","students_tbls.last_name","enrollment_tbls.*","grades.*","grades.subject_id as grade_id",
        DB::raw("CONCAT(students_tbls.last_name, ', ',students_tbls.first_name, ' ',students_tbls.middle_name) as student_name")
        )
        ->join("enrollment_tbls","enrollment_tbls.student_id","students_tbls.id")
        ->join("grades","students_tbls.id","grades.student_id")
        ->where('grades.subject_id',$id)->get();

select `grades`.*, `subject_tbls`.`subject_name` as `subject_name` from `grades` inner join `subject_tbls` on `grades`.`subject_id` = `subject_tbls`.`id` where md5(student_id) = '9d2682367c3935defcb1f9e247a97c0d' and `grades`.`subject_id` = '35'
---
    public function edit(Request $request,$id)
    {
        //
        $data['getDataById'] = Grade::select("grades.*",
        "subject_tbls.subject_name as subject_name")
        ->join("subject_tbls","grades.subject_id","subject_tbls.id")
        ->where(DB::raw('md5(student_id)'), $id)->where('grades.subject_id',$request->id)->get();

update `grades` set `grade` = '89' where (`id` = '8324' and md5(student_id) = '2d969e2cee8cfa07ce7ca0bb13c7a36d')
---
    public function update(Request $request, $id)
    {
        //
        $nums =count($request->grades);
        $x =0;
        while($x<$nums){
        $update = Grade::where([['id', $request->gradeName[$x]],[DB::raw('md5(student_id)'), $id]]);
        $data['grade'] = $request->grades[$x];
        $update->update($data);