app/Http/Controllers/DashboardController.php

    public function __construct()
    {
        $this->sy = SchoolYearTbl::latest('school_years')->first();
        $this->term = TermsTbl::oldest('term_name')->first();
---
select * from `school_year_tbls` order by `school_years` desc limit 1
select * from `terms_tbls` order by `term_name` asc limit 1

    public function index(Request $request)
    {
        // Check if staff role
        $user = UsersTbl::with(['staff', 'role'])->findOrFail(session('user')->id);

        // Check if user has staff info or relationship existing
        if ($user->staff()->exists()) {

            // Check if staff has completed his profile or changed his password
            $defaultPassword = "PSBCNumber1";
            if (password_verify(sha1($defaultPassword, TRUE), $user->password)) {
                return redirect()->route('staff_profile')->with('warning', 'Please update your password or profile');
            }

        }

        if ($user->role->role_name == "Student") {
            return redirect('/profile');
        }

        $permissions = AccessRoute::user_permissions(session('user')->id);

        $sy = empty($_GET['school_year_select']) ? $this->sy->school_years : strip_tags($_GET['school_year_select']);
        $selectedTerm = empty($_GET['term_select']) ? $this->term->term_name : strip_tags($_GET['term_select']);

        $schoolYear = SchoolYearTbl::all();
        $terms = TermsTbl::where('term_name', '!=', 'N/A')->get();
---
select * from `role_tbls` where `role_tbls`.`id` in (1)
select * from `users_tbls` where `users_tbls`.`id` = 1 limit 1
select * from `school_year_tbls`
select * from `terms_tbls` where `term_name` != 'N/A'

        }

        // Get Students by school year, branch
        $users = UsersTbl::whereRelation('role', 'role_name', 'Student')
            ->whereRelation('student.enrollment.school_year', 'school_years', $sy)
            ->whereRelation('student.enrollment.branch', 'branch_id', session('user')->branch_id)
            ->has('student.enrollment')
            ->with('role', 'student.enrollment.program_majors')
            ->latest('joined_at')
            ->take(50)
            ->get()
            ->makeHidden(['branch_id', 'user_name', 'password', 'salt', 'email', 'full_name']);

        // count of active enrollees by branch, school year & term
        $countEnrolees = EnrollmentTbl::whereRelation('student.enrollment.school_year', 'school_years', $sy)
            ->whereRelation('student.enrollment.branch', 'id', session('user')->branch_id)
            ->whereRelation('term', 'term_name', $selectedTerm)
            ->where('is_approved', 1)
            ->count();
---
select * from `role_tbls` where `role_tbls`.`id` in (3)
select * from `users_tbls` where exists (select * from `role_tbls` where `users_tbls`.`role_id` = `role_tbls`.`id` and `role_name` = 'Student') and exists (select * from `students_tbls` where `users_tbls`.`id` = `students_tbls`.`user_id` and exists (select * from `enrollment_tbls` where `students_tbls`.`id` = `enrollment_tbls`.`student_id` and exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023'))) and exists (select * from `students_tbls` where `users_tbls`.`id` = `students_tbls`.`user_id` and exists (select * from `enrollment_tbls` where `students_tbls`.`id` = `enrollment_tbls`.`student_id` and exists (select * from `branch_tbls` where `enrollment_tbls`.`branch_id` = `branch_tbls`.`id` and `branch_id` = 1))) and exists (select * from `students_tbls` where `users_tbls`.`id` = `students_tbls`.`user_id` and exists (select * from `enrollment_tbls` where `students_tbls`.`id` = `enrollment_tbls`.`student_id`)) order by `joined_at` desc limit 50
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `students_tbls` where `enrollment_tbls`.`student_id` = `students_tbls`.`id` and exists (select * from `enrollment_tbls` where `students_tbls`.`id` = `enrollment_tbls`.`student_id` and exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023'))) and exists (select * from `students_tbls` where `enrollment_tbls`.`student_id` = `students_tbls`.`id` and exists (select * from `enrollment_tbls` where `students_tbls`.`id` = `enrollment_tbls`.`student_id` and exists (select * from `branch_tbls` where `enrollment_tbls`.`branch_id` = `branch_tbls`.`id` and `id` = 1))) and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` = '1st') and `is_approved` = 1

        $onlyYear = explode('-', $sy);

        // Get Recent Employees, by branch, and school year
        $employees = UsersTbl::has('staff')->
        whereHas('role', function ($q) {
            $q->where('role_name', '!=', 'Student');
        })
            ->whereRelation('branch', 'id', session('user')->branch_id)
            ->where(function ($query) use ($onlyYear) {
                $query->whereYear('joined_at', $onlyYear[0])
                    ->orWhereYear('joined_at', $onlyYear[1]);
            })
            ->with('staff', 'role')
            ->limit(25)->latest('joined_at')->get();

        // Count of users account by branch and year
        $userCount = UsersTbl::whereRelation('branch', 'id', session('user')->branch_id)
            ->where('is_active', 1)
            ->whereYear('joined_at', $onlyYear[0])
            ->orWhereYear('joined_at', $onlyYear[1])
            ->count();

        // Subject Count
        $subjectCount = SubjectTbl::count();
        // Programs Count
        $programCount = ProgramsTbl::count();

        // Get Latest Announcement
        $announcement = Announcement::latest('created_at')->first();
        // Get latest events
        $events = Event::limit(2)->latest()->get();
---
select * from `role_tbls` where `role_tbls`.`id` in (1, 2, 4, 5)
select * from `users_tbls` where exists (select * from `staffs_tbls` where `users_tbls`.`id` = `staffs_tbls`.`user_id`) and exists (select * from `role_tbls` where `users_tbls`.`role_id` = `role_tbls`.`id` and `role_name` != 'Student') and exists (select * from `branch_tbls` where `users_tbls`.`branch_id` = `branch_tbls`.`id` and `id` = 1) and (year(`joined_at`) = '2022' or year(`joined_at`) = '2023') order by `joined_at` desc limit 25
select count(*) as aggregate from `users_tbls` where exists (select * from `branch_tbls` where `users_tbls`.`branch_id` = `branch_tbls`.`id` and `id` = 1) and `is_active` = 1 and year(`joined_at`) = '2022' or year(`joined_at`) = '2023'
select count(*) as aggregate from `subject_tbls`
select count(*) as aggregate from `programs_tbls`
select * from `announcements` order by `created_at` desc limit 1
select * from `events` order by `created_at` desc limit 2

                })
                ->count();
        } else {
            $newKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->whereHas('term', function ($query) {
                    $query->where('term_name', '!=', 'Summer');
                })
                ->where('branch_id', session('user')->branch_id)
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'New');
                })
                ->where(function ($query) {
                    $query->where('student_department', 'Elementary')
                        ->orWhere('student_department', 'JHS');
                })
                ->count();

            $newNOTKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->whereRelation('term', 'term_name', $term)
                ->where('branch_id', session('user')->branch_id)
                ->where(function ($query) {
                    $query->where('student_department', '!=', 'Elementary')
                        ->where('student_department', '!=', 'JHS');
                })
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'New');
                })
                ->count();
---
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` != 'Summer') and `branch_id` = 1 and (`is_approved` = 1 and `student_type` = 'New') and (`student_department` = 'Elementary' or `student_department` = 'JHS')
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` = '1st') and `branch_id` = 1 and (`student_department` != 'Elementary' and `student_department` != 'JHS') and (`is_approved` = 1 and `student_type` = 'New')

                })
                ->count();
        } else {
            $oldKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->where('branch_id', session('user')->branch_id)
                ->whereHas('term', function ($query) {
                    $query->where('term_name', '!=', 'Summer');
                })
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'Old');
                })
                ->where(function ($query) {
                    $query->where('student_department', 'Elementary')
                        ->orWhere('student_department', 'JHS');
                })
                ->count();

            $oldNOTKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->whereRelation('term', 'term_name', $term)
                ->where('branch_id', session('user')->branch_id)
                ->where(function ($query) {
                    $query->where('student_department', '!=', 'Elementary')
                        ->where('student_department', '!=', 'JHS');
                })
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'Old');
                })
                ->count();
---
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and `branch_id` = 1 and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` != 'Summer') and (`is_approved` = 1 and `student_type` = 'Old') and (`student_department` = 'Elementary' or `student_department` = 'JHS')
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` = '1st') and `branch_id` = 1 and (`student_department` != 'Elementary' and `student_department` != 'JHS') and (`is_approved` = 1 and `student_type` = 'Old')

                })
                ->count();
        } else {
            $transfereeKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->where('branch_id', session('user')->branch_id)
                ->whereHas('term', function ($query) {
                    $query->where('term_name', '!=', 'Summer');
                })
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'Transferee');
                })
                ->where(function ($query) {
                    $query->where('student_department', 'Elementary')
                        ->orWhere('student_department', 'JHS');
                })
                ->count();

            $transfereeNOTKto10StudentsCount = EnrollmentTbl::whereRelation('school_year', 'school_years', $sy)
                ->whereRelation('term', 'term_name', $term)
                ->where('branch_id', session('user')->branch_id)
                ->where(function ($query) {
                    $query->where('student_department', '!=', 'Elementary')
                        ->where('student_department', '!=', 'JHS');
                })
                ->where(function ($query) {
                    $query->where('is_approved', 1)
                        ->where('student_type', 'Transferee');
                })
                ->count();
---
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and `branch_id` = 1 and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` != 'Summer') and (`is_approved` = 1 and `student_type` = 'Transferee') and (`student_department` = 'Elementary' or `student_department` = 'JHS')
select count(*) as aggregate from `enrollment_tbls` where exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and exists (select * from `terms_tbls` where `enrollment_tbls`.`term_id` = `terms_tbls`.`id` and `term_name` = '1st') and `branch_id` = 1 and (`student_department` != 'Elementary' and `student_department` != 'JHS') and (`is_approved` = 1 and `student_type` = 'Transferee')