app/Http/Controllers/ElemToSHSGradeController.php

select `students_tbls`.`id` as `student_id`, `sections_tbls`.`id` as `section_id`, `enrollment_tbls`.*, CONCAT(students_tbls.last_name, ', ',students_tbls.first_name, ' ',students_tbls.middle_name) as student_name from `students_tbls` inner join `enrollment_tbls` on `enrollment_tbls`.`student_id` = `students_tbls`.`id` inner join `sections_tbls` on `enrollment_tbls`.`section_id` = `sections_tbls`.`id` where `section_id` = '49'
---
    public function show(Request $request, $id)
    {
        //
        $sectionOne =  SectionsTbl::all()->where('id',$id);
        if(count($sectionOne)>0){
            if ($request->ajax()) {
        $students = StudentsTbl::select(
        "students_tbls.id as student_id","sections_tbls.id as section_id","enrollment_tbls.*",
        DB::raw("CONCAT(students_tbls.last_name, ', ',students_tbls.first_name, ' ',students_tbls.middle_name) as student_name")
        )
        ->join("enrollment_tbls","enrollment_tbls.student_id","students_tbls.id")
        ->join("sections_tbls","enrollment_tbls.section_id","sections_tbls.id")
        ->where('section_id',$id)->get();