app/Http/Controllers/EnrollmentController.php

select * from `home_settings` limit 1
select * from `about_settings` limit 1
select * from `campus_photos`
select * from `branch_tbls`
---
    public function index()
    {
        //
        $data['school_year'] = Helpers::currentSchoolYear('school_years');//place here selected school year
        $data['home'] = HomeSettings::first();
        $data['about'] = AboutSettings::first();
        $data['campus_photos'] = CampusPhotos::all();
        $data['branches'] = BranchTbl::all();

select * from `guardian_tbls` where (`first_name` = 'marites' and `middle_name` = 'cagayat' and `last_name` = 'rictin') limit 1
select count(*) as aggregate from `guardian_tbls` where (`first_name` = 'marites' and `middle_name` = 'cagayat' and `last_name` = 'rictin')
---

                $is_guardian_exist = GuardianTbl::where(array('first_name' => $gur_first_name, 'middle_name' => $gur_middle_name, 'last_name' => $gur_last_name));

                if($is_guardian_exist->count() > 0){

select * from `enrollment_tbls` where (`school_year_id` = 2 and `student_department` = 'SHS')
---
       $year = Helpers::currentSchoolYear('school_years');
       $school_year_id = Helpers::currentSchoolYear('id');

       $students = EnrollmentTbl::where(array('school_year_id' => $school_year_id, 'student_department' => $stud_dept))->get(); //select all rows with same school year and student dept

select * from `school_year_tbls` where `is_active` = 1 limit 1
select * from `levels_tbls` where (`student_dept` is null and `is_active` = 1)
select `curriculum_tbls`.`id` as `id`, `programs_tbls`.`program_name` as `pname`, `majors_tbls`.`major_name` as `mname` from `branch_colleges_programs_majors_tbls` left join `program_majors_tbls` on `branch_colleges_programs_majors_tbls`.`program_major_id` = `program_majors_tbls`.`id` left join `programs_tbls` on `program_majors_tbls`.`program_id` = `programs_tbls`.`id` left join `majors_tbls` on `program_majors_tbls`.`major_id` = `majors_tbls`.`id` left join `curriculum_tbls` on `curriculum_tbls`.`program_major_id` = `program_majors_tbls`.`id` where `branch_colleges_programs_majors_tbls`.`branch_id` = '1' and `curriculum_tbls`.`school_year_id` = 2 and `curriculum_tbls`.`level_id` is null and `curriculum_tbls`.`student_department` is null and `curriculum_tbls`.`is_active` = 1
---
    public function getCurriculumByStudDeptAndLevel(Request $request)
    {
        $stud_dept = $request->stud_dept;
        $stud_level = $request->stud_level;
        $branch_id = $request->branch_id;
        $school_year = SchoolYearTbl::where('is_active', 1)->first()->id;
        $data['levels'] = LevelsTbl::where(array('student_dept' => $stud_dept, 'is_active' => 1))->get();
        $data['curriculums'] = BranchCollegesProgramsMajorsTbl::select(
            "curriculum_tbls.id as id",
            "programs_tbls.program_name as pname",
            "majors_tbls.major_name as mname")
            ->leftJoin('program_majors_tbls', 'branch_colleges_programs_majors_tbls.program_major_id', '=', 'program_majors_tbls.id')
            ->leftJoin('programs_tbls', 'program_majors_tbls.program_id', '=', 'programs_tbls.id')
            ->leftJoin('majors_tbls', 'program_majors_tbls.major_id', '=', 'majors_tbls.id')
            ->leftJoin('curriculum_tbls', 'curriculum_tbls.program_major_id', '=', 'program_majors_tbls.id')
            ->where('branch_colleges_programs_majors_tbls.branch_id',$branch_id)
            ->where('curriculum_tbls.school_year_id',$school_year)
            ->where('curriculum_tbls.level_id',$stud_level)
            ->where('curriculum_tbls.student_department', $stud_dept)
            ->where('curriculum_tbls.is_active',1)->get();

select * from `document_type_tbls` where (`student_dept` = 'SHS' and `student_type` = 'Cross Enrollee')
---
    public function getDocumentsByStudDeptAndType(Request $request)
    {
        $stud_dept = $request->stud_dept;
        $stud_type = $request->stud_type;
        $data['documents'] = DocumentTypeTbl::where(array('student_dept' => $stud_dept, 'student_type' => $stud_type))->get();