app/Http/Controllers/GradeSettingController.php

    public function edit(Request $request, $id)
    {
        //
        $getDataById = GradeSettings::where(DB::raw('md5(id)'), $id)->get();
---
select * from `grade_settings` where md5(id) = '4e732ced3463d06de0ca9a15b6153677'

    public function update(Request $request, $id)
    {
        //
        $update = GradeSettings::where(DB::raw('md5(id)'), $id);
        $data['grade_range'] = $request->grade_range1;
        $data['point_equivalent'] = $request->point_equivalent1;
        $data['letter_equivalent'] = $request->letter_equivalent1;
        $data['status'] = $request->status1;
        $update->update($data);
---
update `grade_settings` set `grade_range` = '50', `point_equivalent` = '4.0', `letter_equivalent` = 'INC', `status` = 'For Completion' where md5(id) = '8e296a067a37563370ded05f5a3bf3ec'