app/Http/Controllers/HomeSettingsController.php

    public function home(Request $request)
    {
        $home = HomeSettings::first();
        // Check for maintenance mode
        if ($home->is_maintenance == true) {
            return view('ui.maintenance');
        }

        $events = Event::limit(2)->latest('created_at')->get();
        $announcements = Announcement::limit(3)->latest('created_at')->get();

        $campus_photos = CampusPhotos::all();
        $branches = BranchTbl::all();
---
select * from `home_settings` limit 1
select * from `events` order by `created_at` desc limit 2
select * from `announcements` order by `created_at` desc limit 3
select * from `campus_photos`
select * from `branch_tbls`