app/Http/Controllers/LoginController.php

select * from `users_tbls` where `email` = 'psbc.family.school@gmail.com' and `is_active` = 1 limit 1
---
    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required',
            'password' => 'required'
        ]);

        $user = UsersTbl::select("*")
            ->where('email', $request->email)
            ->where('is_active', 1)
            ->with(['staff', 'student', 'branch'])
            ->first();