app/Http/Controllers/PaymentsController.php

    public function edit($id)
    {
        //
        $assessment_id = $id;
        $data['assessments_details'] = AssessmentsTbl::select('assessments_tbls.*',
            'students_tbls.user_id')
            ->leftJoin('students_tbls', 'assessments_tbls.student_id', '=', 'students_tbls.id')
            ->where('assessments_tbls.id', $assessment_id)->first();
        $data['payments'] = PaymentHistoryTbl::select(DB::raw("SUM(payment_amount) as total_payment"))
            ->where('is_approved', 1)
            ->where('assessments_id', $assessment_id)->first();
        $getBranch_id = EnrollmentTbl::select('branch_id', 'id')->where('id', $data['assessments_details']->enrollment_id)->first();
        $data['branch_id'] = BranchTbl::select('branch_tbls.*')->where('id', $getBranch_id->branch_id)->first();
---
select SUM(payment_amount) as total_payment from `payment_history_tbls` where `is_approved` = 1 and `assessments_id` = '1773' limit 1
select `assessments_tbls`.*, `students_tbls`.`user_id` from `assessments_tbls` left join `students_tbls` on `assessments_tbls`.`student_id` = `students_tbls`.`id` where `assessments_tbls`.`id` = '1773' limit 1
select `branch_id`, `id` from `enrollment_tbls` where `id` = 1850 limit 1
select `branch_tbls`.* from `branch_tbls` where `id` = 1 limit 1

    public function savePayments(Request $request, $length = 12)
    {
        //
        $payment_amount = $request->payment_amount;
        $available_balance = $request->payment_available_balance;

        if ($available_balance >= 0 && $payment_amount >= 0) {

            $payment = new PaymentHistoryTbl();
            $payment->student_id = $request->student_id;
            $payment->branch_id = $request->branch_id;
            $payment->assessments_id = $request->assessment_id;
            $payment->payment_method = $request->payment_type;
            $payment->payment_amount = $request->payment_amount;
            $payment->or_number = $request->or_number;
            $payment->payment_type = $request->payment_for;
            $payment->is_approved = 1;
            $payment->is_active = 1;
            $payment->encoded_by = $request->created_by;
            $payment->created_at = $request->payment_date;
            if ($payment->save()) {

                $total_bal = ($available_balance - $payment_amount);

                if ($total_bal == 0) {
                    $assessment = AssessmentsTbl::find($request->assessment_id);
                    $assessment->status = 'Paid';
                    $assessment->save();
---
insert into `payment_history_tbls` (`student_id`, `branch_id`, `assessments_id`, `payment_method`, `payment_amount`, `or_number`, `payment_type`, `is_approved`, `is_active`, `encoded_by`, `created_at`, `updated_at`) values ('1917', '1', '2020', 'Cash', '1500', '388252', 'Registration Fee', 1, 1, 'joyceludovico', '2023-01-18 00:00:00', '2023-02-10 14:35:44')
select * from `assessments_tbls` where `assessments_tbls`.`id` = '2020' limit 1
update `assessments_tbls` set `status` = 'Paid' where `id` = 2020


                if ($request->user_id == '') {

                    $student = StudentsTbl::find($request->student_id);
---
select * from `students_tbls` where `students_tbls`.`id` = '1917' limit 1

                    $user->is_active = 1;
                    Mail::to($user->email)->send(new UserDetailsMail("PSBCNumber1"));
                    if ($user->save()) {
                        $student_ = StudentsTbl::find($request->student_id);
                        $student_->user_id = $user->id;
                        $student_->save();
---
select * from `students_tbls` where `students_tbls`.`id` = '1917' limit 1
update `students_tbls` set `user_id` = 2830 where `id` = 1917


                $is_grade_exist = Grade::where('enrollment_id', $request->enrollment_id);

                if ($is_grade_exist->count() > 0) {

                } else {
                    $get_subject_ids = EnrollmentTbl::where('id', $request->enrollment_id)->first();
---
select count(*) as aggregate from `grades` where `enrollment_id` = '2143'
select * from `enrollment_tbls` where `id` = '2143' limit 1

                            $grades->subject_id = trim($subjects[$ii]);
                            $grades->grade = '0';
                            $grades->status = 'ongoing';
                            $grades->save();
---
insert into `grades` (`student_id`, `enrollment_id`, `subject_id`, `grade`, `status`) values ('1917', '2143', '285', '0', 'ongoing')