app/Http/Controllers/StudentGradeController.php

select * from `school_year_tbls` where `is_active` = '1' order by `school_years` desc limit 1
---
    public function index(Request $request)
    {
        $id = session('user')->id; // User ID

        // Latest School Year
        $sy = SchoolYearTbl::latest('school_years')->where("is_active", '1')->first();