app/Http/Controllers/StudentsEnrollmentController.php

select * from `terms_tbls` where `is_active` = 1
select * from `students_tbls`
select * from `branch_tbls`
select * from `school_year_tbls`
select * from `school_year_tbls` where `is_active` = 1 order by `school_years` desc limit 1
select * from `levels_tbls` where (`student_dept` is null and `is_active` = 1)
---
        $current_school_year = Helpers::currentSchoolYear('school_years'); //place here selected school year
        $enrollees = EnrollmentTbl::select('student_id')->where('school_year_id', $current_school_id);
        $data['permissions'] = AccessRoute::user_permissions(session('user')->id);
        $data['terms'] = TermsTbl::where('is_active', 1)->get();
        // $data['students'] = StudentsTbl::whereNotIn('id', $enrollees)->get();
        $data['students'] = StudentsTbl::all();
        // $data['levels'] = LevelsTbl::where(array('student_dept' => $student_department,'is_active'=> 1))->get();
        $data['branches'] = BranchTbl::all();
        $data['school_year'] = $current_school_year;
        $data['school_year_id'] = $current_school_id;
        $data['school_years'] = SchoolYearTbl::all();
        $stud_dept = $request->stud_dept;
        $stud_level = $request->stud_level;
        $branch_id = $request->branch_id;
        $school_year = SchoolYearTbl::latest('school_years')->where('is_active', 1)->first()->id;
        $data['levels'] = LevelsTbl::where(array('student_dept' => $stud_dept, 'is_active' => 1))->get();

insert into `enrollment_tbls` (`student_id`, `application_no`, `section_id`, `term_id`, `level_id`, `student_type`, `student_department`, `branch_id`, `school_year_id`, `curriculum_id`, `remarks`, `subject_ids`, `is_approved`) values ('1165', 'COL-2022-2023-0873', '21', '2', '16', 'Old', 'College', '1', '2', '27', '', '[\"199\",\"227\",\"228\",\"229\",\"230\",\"231\"]', 1)
---
    public function store(Request $request, $length = 12)
    {
        if ($request->subjects != '') {
            $app_no = $this->createApplicationNo($request->student_department);
            $enrollment = new EnrollmentTbl();
            $enrollment->student_id = $request->student;
            $enrollment->application_no = $app_no;
            $enrollment->section_id = $request->section;
            $enrollment->term_id = $request->term;
            $enrollment->level_id = $request->student_level;
            $enrollment->student_type = 'Old';
            $enrollment->student_department = $request->student_department;
            $enrollment->branch_id = $request->branch;
            $enrollment->school_year_id = $request->school_years;
            $enrollment->curriculum_id = $request->curriculum;
            $enrollment->remarks = $request->remarks;
            $enrollment->subject_ids = json_encode($request->subjects);
            $enrollment->is_approved = 1;
            if ($enrollment->save()) {

select * from `enrollment_tbls` where (`school_year_id` = 2 and `student_department` = 'College')
---
        $year = Helpers::currentSchoolYear('school_years');
        $school_year_id = Helpers::currentSchoolYear('id');

        $students = EnrollmentTbl::where(array('school_year_id' => $school_year_id, 'student_department' => $stud_dept))->get(); //select all rows with same school year and student dept

select `enrollment_tbls`.* from `enrollment_tbls` where `enrollment_tbls`.`student_id` = '26675' and `enrollment_tbls`.`id` = '4081' order by `id` desc limit 1
select * from `levels_tbls` where (`student_dept` = 'Elementary' and `is_active` = 1)
select `enrollment_tbls`.* from `enrollment_tbls` where `enrollment_tbls`.`student_id` = '446' order by `id` desc limit 1
select `curriculum_tbls`.`id` as `id`, `programs_tbls`.`program_name` as `pname`, `majors_tbls`.`major_name` as `mname` from `branch_colleges_programs_majors_tbls` left join `program_majors_tbls` on `branch_colleges_programs_majors_tbls`.`program_major_id` = `program_majors_tbls`.`id` left join `programs_tbls` on `program_majors_tbls`.`program_id` = `programs_tbls`.`id` left join `majors_tbls` on `program_majors_tbls`.`major_id` = `majors_tbls`.`id` left join `curriculum_tbls` on `curriculum_tbls`.`program_major_id` = `program_majors_tbls`.`id` where `branch_colleges_programs_majors_tbls`.`branch_id` = 1 and `curriculum_tbls`.`school_year_id` = 2 and `curriculum_tbls`.`level_id` = 1 and `curriculum_tbls`.`student_department` = 'Elementary' and `curriculum_tbls`.`is_active` = 1
select * from `sections_tbls` where (`branch_id` = 1 and `level_id` = 1 and `is_active` = 1)
select * from `terms_tbls` where `is_active` = 1
select * from `branch_tbls`
select * from `school_year_tbls` where `is_active` = 1
select * from `application_status_view` where `id` = 4081
---
    public function getStudentData(Request $request)
    {
        //
        $id = $request->id; //student id
        $enrollment_id = $request->enrollment_id; //enrollment id
        $data['student_details'] = StudentsTbl::select('students_tbls.*', 'guardian_tbls.first_name AS g_first_name', 'guardian_tbls.middle_name AS g_middle_name', 'guardian_tbls.last_name AS g_last_name', 'guardian_tbls.address AS g_address', 'guardian_tbls.contact_number AS g_contact_number', 'users_tbls.user_name')
            ->leftJoin('guardian_tbls', 'guardian_tbls.id', '=', 'students_tbls.guardian_id')
            ->leftJoin('users_tbls', 'users_tbls.id', '=', 'students_tbls.user_id')
            ->where('students_tbls.id', $id)->get();

        $enrollment = EnrollmentTbl::select('enrollment_tbls.*',)
            ->where('enrollment_tbls.student_id', $id)
            ->where('enrollment_tbls.id', $enrollment_id)
            ->orderBy('id', 'desc');
        $enrollment_id = $enrollment->first()->id;
        $curriculum_id = $enrollment->first()->curriculum_id;
        $branch_id = $enrollment->first()->branch_id;
        $level_id = $enrollment->first()->level_id;
        $student_department = $enrollment->first()->student_department;
        $school_year = $enrollment->first()->school_year_id;
        $data['levels'] = LevelsTbl::where(array('student_dept' => $student_department, 'is_active' => 1))->get();
        $data['curriculums'] = BranchCollegesProgramsMajorsTbl::select(
            "curriculum_tbls.id as id",
            "programs_tbls.program_name as pname",
            "majors_tbls.major_name as mname"
        )
            ->leftJoin('program_majors_tbls', 'branch_colleges_programs_majors_tbls.program_major_id', '=', 'program_majors_tbls.id')
            ->leftJoin('programs_tbls', 'program_majors_tbls.program_id', '=', 'programs_tbls.id')
            ->leftJoin('majors_tbls', 'program_majors_tbls.major_id', '=', 'majors_tbls.id')
            ->leftJoin('curriculum_tbls', 'curriculum_tbls.program_major_id', '=', 'program_majors_tbls.id')
            ->where('branch_colleges_programs_majors_tbls.branch_id', $branch_id)
            ->where('curriculum_tbls.school_year_id', $school_year)
            ->where('curriculum_tbls.level_id', $level_id)
            ->where('curriculum_tbls.student_department', $student_department)
            ->where('curriculum_tbls.is_active', 1)->get();

        $data['sections'] = SectionsTbl::where(array('branch_id' => $branch_id, 'level_id' => $level_id, 'is_active' => 1))->get();
        $data['levels'] = LevelsTbl::where(array('student_dept' => $student_department, 'is_active' => 1))->get();
        $data['terms'] = TermsTbl::where('is_active', 1)->get();
        $data['branches'] = BranchTbl::all();
        $data['school_years'] = SchoolYearTbl::where('is_active', 1)->get();
        $data['subjects'] = $this->getSubjectByCur($curriculum_id, $enrollment_id);
        $data['enrollment'] = $enrollment->get();
        $data['docs'] = $this->getDocuments($id);
        $data['app_stats'] = ApplicationStatusView::where('id', $enrollment_id)->get();

select * from `guardian_tbls` where `guardian_tbls`.`id` = '130' limit 1
---
    public function update(Request $request, $length = 12)
    {
        //
        if ($request->subjects != '') {
            $guardian = GuardianTbl::find($request->guardian_id);

select * from `students_tbls` where `students_tbls`.`id` = '26622' limit 1
---
                    'year_graduated' => $request->year_graduated,
                ];
            }
            $student = StudentsTbl::find($request->student_id);

select * from `enrollment_tbls` where `enrollment_tbls`.`id` = '3605' limit 1
---
            $student->other_details = json_encode($other_details);
            $student->save();

            $enrollment = EnrollmentTbl::find($request->enrollment_id);

update `assessments_tbls` set `status` = 'pending', `student_id` = '1404', `student_department` = 'SHS', `is_active` = 0 where `enrollment_id` = '1350'
---
                // $data['subject_ids'] = json_encode($request->subjects);
                $data['student_department'] = $request->student_department;
                $data['is_active'] = 0;
                $assessment = AssessmentsTbl::where('enrollment_id', $request->enrollment_id)->update($data);

select `documents_tbls`.*, `document_type_tbls`.`document_name` from `documents_tbls` left join `document_type_tbls` on `document_type_tbls`.`id` = `documents_tbls`.`document_type_id` where `documents_tbls`.`student_id` = '26675'
---
    public function getDocuments($id)
    {
        $stud_id = $id;
        $documents = DocumentsTbl::select('documents_tbls.*', 'document_type_tbls.document_name')
            ->leftJoin('document_type_tbls', 'document_type_tbls.id', '=', 'documents_tbls.document_type_id')
            ->where('documents_tbls.student_id', $stud_id)->get();

select count(*) as aggregate from `enrollment_tbls` where `id` = 4081
select `subject_ids` from `enrollment_tbls` where `id` = 4081 limit 1
select `curriculum_subjects_tbls`.`id`, `curriculum_subjects_tbls`.`subject_id`, `subject_tbls`.`lect_unit`, `subject_tbls`.`lab_unit`, `subject_tbls`.`subject_code`, `subject_tbls`.`subject_name`, CONCAT(subject_tbls_2.subject_code,' - ',subject_tbls_2.subject_name) AS preReqSubjectName, `curriculum_subjects_tbls`.`id` from `curriculum_subjects_tbls` left join `subject_tbls` on `curriculum_subjects_tbls`.`subject_id` = `subject_tbls`.`id` left join `subject_tbls` as `subject_tbls_2` on `curriculum_subjects_tbls`.`prerequisite_subject_id` = `subject_tbls_2`.`id` where `curriculum_subjects_tbls`.`is_active` = 1 and `curriculum_subjects_tbls`.`curriculum_id` = 43
---
    public function getSubjectByCur($cur_id, $enrollment_id)
    {
        $cur_id = $cur_id;
        $subject_ids = [];

        $assessment = EnrollmentTbl::select('subject_ids',)
            ->where('id', $enrollment_id);
        if ($assessment->count() > 0) {
            $subject_ids = json_decode($assessment->first()->subject_ids);
        }
        $subjects = CurriculumSubjectsTbl::select(
            'curriculum_subjects_tbls.id',
            'curriculum_subjects_tbls.subject_id',
            'subject_tbls.lect_unit',
            'subject_tbls.lab_unit',
            'subject_tbls.subject_code',
            'subject_tbls.subject_name',
            DB::raw("CONCAT(subject_tbls_2.subject_code,' - ',subject_tbls_2.subject_name) AS preReqSubjectName"),
            "curriculum_subjects_tbls.id"
        )
            ->leftJoin('subject_tbls', 'curriculum_subjects_tbls.subject_id', '=', 'subject_tbls.id')
            ->leftJoin('subject_tbls AS subject_tbls_2', 'curriculum_subjects_tbls.prerequisite_subject_id', '=', 'subject_tbls_2.id')
            ->where('curriculum_subjects_tbls.is_active', 1)
            ->where('curriculum_subjects_tbls.curriculum_id', $cur_id)->get();

select `curriculum_subjects_tbls`.`id`, `curriculum_subjects_tbls`.`subject_id`, `subject_tbls`.`lect_unit`, `subject_tbls`.`lab_unit`, `subject_tbls`.`subject_code`, `subject_tbls`.`subject_name`, CONCAT(subject_tbls_2.subject_code,' - ',subject_tbls_2.subject_name) AS preReqSubjectName, `curriculum_subjects_tbls`.`id` from `curriculum_subjects_tbls` left join `subject_tbls` on `curriculum_subjects_tbls`.`subject_id` = `subject_tbls`.`id` left join `subject_tbls` as `subject_tbls_2` on `curriculum_subjects_tbls`.`prerequisite_subject_id` = `subject_tbls_2`.`id` where `curriculum_subjects_tbls`.`is_active` = 1 and `curriculum_subjects_tbls`.`curriculum_id` = '28'
---
    public function getSubjectByCurAjaxAdd(Request $request)
    {
        $cur_id = $request->curriculum;


        $subjects = CurriculumSubjectsTbl::select(
            'curriculum_subjects_tbls.id',
            'curriculum_subjects_tbls.subject_id',
            'subject_tbls.lect_unit',
            'subject_tbls.lab_unit',
            'subject_tbls.subject_code',
            'subject_tbls.subject_name',
            DB::raw("CONCAT(subject_tbls_2.subject_code,' - ',subject_tbls_2.subject_name) AS preReqSubjectName"),
            "curriculum_subjects_tbls.id"
        )
            ->leftJoin('subject_tbls', 'curriculum_subjects_tbls.subject_id', '=', 'subject_tbls.id')
            ->leftJoin('subject_tbls AS subject_tbls_2', 'curriculum_subjects_tbls.prerequisite_subject_id', '=', 'subject_tbls_2.id')
            ->where('curriculum_subjects_tbls.is_active', 1)
            ->where('curriculum_subjects_tbls.curriculum_id', $cur_id)->get();

select * from `sections_tbls` where (`branch_id` = '1' and `level_id` = '' and `is_active` = 1)
---
    public function getSectionByBranchAndLevel(Request $request)
    {
        $branch_id = $request->branch;
        $level_id = $request->stud_level;
        $data['sections'] = SectionsTbl::where(array('branch_id' => $branch_id, 'level_id' => $level_id, 'is_active' => 1))->get();