app/Http/Controllers/StudentProfileController.php

    public function index()
    {
        // Filter Enrollment Relationship By Latest Enrollment Submitted
        // Upcoming relationships of enrollment will be filtered also
//        $user = UsersTbl::with(['student.guardian',
//            'student.enrollments' => function ($query) {
//                $query->orderBy('date_submitted', 'desc'); // Get the latest submitted enrollment
//            },
//            'student.enrollments.section', // Get section of filtered 'student.enrollments' relationship
//            'student.enrollments.level',
//            'role'
//        ])->findOrFail(session('user')->id);

        $user = UsersTbl::with(['student.guardian',
            'student.latestEnrollment' => function ($query) {
                $query->where('is_approved', 1);
            },
            'student.latestEnrollment.section', // Get section of filtered 'student.latestEnrollment' relationship
            'student.latestEnrollment.level',
            'role'
        ])->findOrFail(session('user')->id);

        abort_if(!$user->student()->exists(), 404);

        // Permissions
        $permissions = AccessRoute::user_permissions(session('user')->id);
        $user_student = UsersTbl::findOrFail(session('user')->id);
        $has_documents = DocumentsTbl::where('student_id', $user_student->student->id)->count();
        $documents = '';

        if(!empty($user->student->oldestEnrollment->student_type) && $user->student->oldestEnrollment->student_type == "Old" && $has_documents == 0 ){
            $documents = DocumentTypeTbl::where([['student_type', '=', $user->student->oldestEnrollment->student_type],['student_dept', '=', $user->student->oldestEnrollment->student_department]])->get();
---
select * from `role_tbls` where `role_tbls`.`id` in (3)
select * from `users_tbls` where `users_tbls`.`id` = 380 limit 1
select count(*) as aggregate from `documents_tbls` where `student_id` = 460
select * from `document_type_tbls` where (`student_type` = 'Old' and `student_dept` = 'SHS')

    public function basicInfo(BasicInfoRequest $request)
    {
        $user = UsersTbl::findOrFail(session('user')->id);
---
select * from `users_tbls` where `users_tbls`.`id` = 917 limit 1

    public function addressDetails(AddressDetailsRequest $request)
    {
        $user = UsersTbl::findOrFail(session('user')->id);
---
select * from `users_tbls` where `users_tbls`.`id` = 917 limit 1

    public function guardianDetails(GuardianDetailsRequest $request)
    {
        $student = StudentsTbl::where('user_id', session('user')->id)->firstOrFail();

        $student->guardian()->update($request->validated());
---
update `students_tbls` set `address` = 'Paete, Laguna', `contact_number` = '+63 9615350552' where `students_tbls`.`user_id` = 917 and `students_tbls`.`user_id` is not null