app/Http/Controllers/StudentsEnrollmentHistoryController.php

select * from `levels_tbls`
select * from `terms_tbls` where `is_active` = 1
select * from `users_tbls` where `users_tbls`.`id` = 2801 limit 1
---
        $data['permissions'] = AccessRoute::user_permissions($user_id);
        $data['school_year_id'] = Helpers::currentSchoolYear('id');
        $data['school_year'] = Helpers::currentSchoolYear('school_years');
        $data['levels'] = LevelsTbl::all();
        $data['terms'] = TermsTbl::where('is_active', 1)->get();
        $data['user'] = UsersTbl::find(session('user')->id);