app/Http/Controllers/UserController.php

select * from `page_tbls`
select * from `role_tbls`
select * from `branch_tbls` where (`id` = 1)
---
        }

        if (session('user')->id === 1) {
            $branches = BranchTbl::all();
        } else {

            $branches = BranchTbl::all()->where('id', session('user')->branch_id)->first();

select * from `users_tbls`
---
        $roles = RoleTbl::all();
        $title = "Users";
        $pages = PageTbl::all();
        $one = UsersTbl::all()->sortByDesc("id")->first();

insert into `salaries` (`staff_id`, `salary_amount`, `salary_classification`, `special_allowance`, `employment_status`, `is_active`, `encoded_by`, `created_at`, `updated_at`) values (150, 0, 'daily', 0, 'regular', 1, 'I_ am PSBC', '2023-02-12 07:56:11', '2023-02-12 07:56:11')
insert into `time_settings` (`staff_id`, `morning_in`, `morning_out`, `afternoon_in`, `afternoon_out`, `days`, `required_time`, `updated_at`, `created_at`) values (150, '', '', '', '', '', '', '2023-02-12 07:56:11', '2023-02-12 07:56:11')
---
        $Salary->encoded_by = session('user')->full_name;
        $Salary->created_at = $nowInManila;
        $Salary->updated_at = $nowInManila;
        $Salary->save();

        // Time Settings
        TimeSettings::create([
            'staff_id' => $Staff->id,
            'morning_in' => NULL,
            'morning_out' => NULL,
            'afternoon_in' => NULL,
            'afternoon_out' => NULL,
            'days' => NULL,
            'required_time' => NULL
        ]);