app/Models/Grade.php

select * from `school_year_tbls` where `is_active` = '1' order by `school_years` desc limit 1
select `id`, `student_id`, `school_year_id`, `student_department` from `enrollment_tbls` where exists (select * from `students_tbls` where `enrollment_tbls`.`student_id` = `students_tbls`.`id` and `user_id` = 2801) and exists (select * from `school_year_tbls` where `enrollment_tbls`.`school_year_id` = `school_year_tbls`.`id` and `school_years` = '2022-2023') and `is_approved` = 1 order by `date_submitted` desc limit 1
select * from `grade_settings` where `status` = 'Passed' and `level_department` = 'College'
select * from `grade_settings` where `status` = 'Failed' and `level_department` = 'College'
---
    public function getStudentGradeAttribute()
    {
        $id = session('user')->id; // User ID

        // Latest School Year
        $sy = SchoolYearTbl::latest('school_years')->where("is_active", '1')->first();

        $enrollment = EnrollmentTbl::whereRelation('student', 'user_id', $id)
            ->whereRelation('school_year', 'school_years', $sy->school_years)
            ->where('is_approved', 1)
            ->latest('date_submitted') // Latest Enrollment
            ->first(['id', 'student_id', 'school_year_id', 'student_department']);

        $passingGradeByDepartment = GradeSettings::where('status', 'Passed')
            ->where('level_department', $enrollment->student_department)->get();

        $failedGradeByDepartment = GradeSettings::where('status', 'Failed')
            ->where('level_department', $enrollment->student_department)->get();