app/Utilities/AccessRoute.php

    public static function user_permissions($id)
    {
        $user = UsersTbl::with('pages')->findOrFail($id);
---
select * from `users_tbls` where `users_tbls`.`id` = 1 limit 1
select `page_tbls`.*, `permissions`.`user_id` as `pivot_user_id`, `permissions`.`page_id` as `pivot_page_id` from `page_tbls` inner join `permissions` on `page_tbls`.`id` = `permissions`.`page_id` where `permissions`.`user_id` in (1)