app/Utilities/AuditTrail.php

insert into `audit_trail_tbls` (`action_taken`, `description`, `new_data`, `old_data`, `url`, `ip`, `user_id`, `datetime`) values ('Logged In', 'Logged In to PSBC with authentication', '', '', 'https://www.iampsbc.com/login', '2001:4453:4e4:e700:5533:41af:7d71:452b', 1, '2023-02-10 10:56:30')
---
    public static function logAuditTrail($action_taken, $description, $new_data = null, $old_data = null)
    {
        $user_id = session('user')->id;

        $audit = new AuditTrailTbl();

        $audit->action_taken = $action_taken;
        $audit->description = $description;
        $audit->new_data = $new_data;
        $audit->old_data = $old_data;
        $audit->url = URL::full();
        $audit->ip = Request::ip();
        $audit->user_id = $user_id;
        $audit->datetime = NOW();
        $audit->save();