app/Utilities/Helpers.php

select * from `school_year_tbls` where `is_active` = 1 limit 1
---
    public static function currentSchoolYear($column)
    {
        $school_year = SchoolYearTbl::where( 'is_active' , 1)->first();